load-tests/results/scale-3-20260812-215814.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /scripts/seckill.js
        output: -

     scenarios: (100.00%) 1 scenario, 10000 max VUs, 2m30s max duration (incl. graceful stop):
              * staged_seckill: Up to 10000.00 iterations/s for 2m0s over 4 stages (maxVUs: 500-10000, gracefulStop: 30s)


running (0m01.0s), 00000/00500 VUs, 109 complete and 0 interrupted iterations
staged_seckill   [   1% ] 00001/00500 VUs  0m01.0s/2m0s  00128.96 iters/s

running (0m02.0s), 00003/00500 VUs, 250 complete and 0 interrupted iterations
staged_seckill   [   2% ] 00003/00500 VUs  0m02.0s/2m0s  00158.78 iters/s

running (0m03.0s), 00000/00500 VUs, 427 complete and 0 interrupted iterations
staged_seckill   [   2% ] 00000/00500 VUs  0m03.0s/2m0s  00188.81 iters/s

running (0m04.0s), 00002/00500 VUs, 629 complete and 0 interrupted iterations
staged_seckill   [   3% ] 00002/00500 VUs  0m04.0s/2m0s  00218.84 iters/s

running (0m05.0s), 00002/00500 VUs, 863 complete and 0 interrupted iterations
staged_seckill   [   4% ] 00002/00500 VUs  0m05.0s/2m0s  00248.86 iters/s

running (0m06.0s), 00001/00500 VUs, 1127 complete and 0 interrupted iterations
staged_seckill   [   5% ] 00001/00500 VUs  0m06.0s/2m0s  00278.77 iters/s

running (0m07.0s), 00002/00500 VUs, 1420 complete and 0 interrupted iterations
staged_seckill   [   6% ] 00002/00500 VUs  0m07.0s/2m0s  00308.79 iters/s

running (0m08.0s), 00001/00500 VUs, 1745 complete and 0 interrupted iterations
staged_seckill   [   7% ] 00001/00500 VUs  0m08.0s/2m0s  00338.81 iters/s

running (0m09.0s), 00000/00500 VUs, 2100 complete and 0 interrupted iterations
staged_seckill   [   7% ] 00000/00500 VUs  0m09.0s/2m0s  00368.82 iters/s

running (0m10.0s), 00000/00500 VUs, 2483 complete and 0 interrupted iterations
staged_seckill   [   8% ] 00000/00500 VUs  0m10.0s/2m0s  00398.76 iters/s

running (0m11.0s), 00001/00500 VUs, 2897 complete and 0 interrupted iterations
staged_seckill   [   9% ] 00001/00500 VUs  0m11.0s/2m0s  00428.85 iters/s

running (0m12.0s), 00000/00500 VUs, 3341 complete and 0 interrupted iterations
staged_seckill   [  10% ] 00000/00500 VUs  0m12.0s/2m0s  00458.79 iters/s

running (0m13.0s), 00001/00500 VUs, 3814 complete and 0 interrupted iterations
staged_seckill   [  11% ] 00001/00500 VUs  0m13.0s/2m0s  00488.80 iters/s

running (0m14.0s), 00001/00500 VUs, 4318 complete and 0 interrupted iterations
staged_seckill   [  12% ] 00001/00500 VUs  0m14.0s/2m0s  00518.82 iters/s

running (0m15.0s), 00001/00500 VUs, 4852 complete and 0 interrupted iterations
staged_seckill   [  12% ] 00001/00500 VUs  0m15.0s/2m0s  00548.83 iters/s

running (0m16.0s), 00001/00500 VUs, 5416 complete and 0 interrupted iterations
staged_seckill   [  13% ] 00001/00500 VUs  0m16.0s/2m0s  00578.84 iters/s

running (0m17.0s), 00002/00500 VUs, 6009 complete and 0 interrupted iterations
staged_seckill   [  14% ] 00002/00500 VUs  0m17.0s/2m0s  00608.84 iters/s

running (0m18.0s), 00000/00500 VUs, 6634 complete and 0 interrupted iterations
staged_seckill   [  15% ] 00000/00500 VUs  0m18.0s/2m0s  00638.80 iters/s

running (0m19.0s), 00001/00500 VUs, 7287 complete and 0 interrupted iterations
staged_seckill   [  16% ] 00001/00500 VUs  0m19.0s/2m0s  00668.81 iters/s

running (0m20.0s), 00002/00500 VUs, 7971 complete and 0 interrupted iterations
staged_seckill   [  17% ] 00002/00500 VUs  0m20.0s/2m0s  00698.86 iters/s

running (0m21.0s), 00002/00500 VUs, 8684 complete and 0 interrupted iterations
staged_seckill   [  17% ] 00002/00500 VUs  0m21.0s/2m0s  00728.83 iters/s

running (0m22.0s), 00002/00500 VUs, 9428 complete and 0 interrupted iterations
staged_seckill   [  18% ] 00002/00500 VUs  0m22.0s/2m0s  00758.83 iters/s

running (0m23.0s), 00002/00500 VUs, 10202 complete and 0 interrupted iterations
staged_seckill   [  19% ] 00002/00500 VUs  0m23.0s/2m0s  00788.84 iters/s

running (0m24.0s), 00001/00500 VUs, 11006 complete and 0 interrupted iterations
staged_seckill   [  20% ] 00001/00500 VUs  0m24.0s/2m0s  00818.81 iters/s

running (0m25.0s), 00001/00500 VUs, 11840 complete and 0 interrupted iterations
staged_seckill   [  21% ] 00001/00500 VUs  0m25.0s/2m0s  00848.82 iters/s

running (0m26.0s), 00000/00500 VUs, 12703 complete and 0 interrupted iterations
staged_seckill   [  22% ] 00000/00500 VUs  0m26.0s/2m0s  00878.82 iters/s

running (0m27.0s), 00001/00500 VUs, 13598 complete and 0 interrupted iterations
staged_seckill   [  22% ] 00001/00500 VUs  0m27.0s/2m0s  00908.83 iters/s

running (0m28.0s), 00002/00500 VUs, 14522 complete and 0 interrupted iterations
staged_seckill   [  23% ] 00002/00500 VUs  0m28.0s/2m0s  00938.87 iters/s

running (0m29.0s), 00001/00500 VUs, 15475 complete and 0 interrupted iterations
staged_seckill   [  24% ] 00001/00500 VUs  0m29.0s/2m0s  00968.81 iters/s

running (0m30.0s), 00001/00500 VUs, 16460 complete and 0 interrupted iterations
staged_seckill   [  25% ] 00001/00500 VUs  0m30.0s/2m0s  00998.84 iters/s

running (0m31.0s), 00001/00500 VUs, 17491 complete and 0 interrupted iterations
staged_seckill   [  26% ] 00001/00500 VUs  0m31.0s/2m0s  01064.11 iters/s

running (0m32.0s), 00000/00500 VUs, 18588 complete and 0 interrupted iterations
staged_seckill   [  27% ] 00000/00500 VUs  0m32.0s/2m0s  01130.69 iters/s

running (0m33.0s), 00001/00500 VUs, 19751 complete and 0 interrupted iterations
staged_seckill   [  27% ] 00001/00500 VUs  0m33.0s/2m0s  01197.36 iters/s

running (0m34.0s), 00001/00500 VUs, 20982 complete and 0 interrupted iterations
staged_seckill   [  28% ] 00001/00500 VUs  0m34.0s/2m0s  01264.04 iters/s

running (0m35.0s), 00002/00500 VUs, 22279 complete and 0 interrupted iterations
staged_seckill   [  29% ] 00002/00500 VUs  0m35.0s/2m0s  01330.74 iters/s

running (0m36.0s), 00002/00500 VUs, 23643 complete and 0 interrupted iterations
staged_seckill   [  30% ] 00002/00500 VUs  0m36.0s/2m0s  01397.40 iters/s

running (0m37.0s), 00001/00500 VUs, 25073 complete and 0 interrupted iterations
staged_seckill   [  31% ] 00002/00500 VUs  0m37.0s/2m0s  01464.03 iters/s

running (0m38.0s), 00004/00500 VUs, 26570 complete and 0 interrupted iterations
staged_seckill   [  32% ] 00004/00500 VUs  0m38.0s/2m0s  01530.77 iters/s

running (0m39.0s), 00002/00500 VUs, 28135 complete and 0 interrupted iterations
staged_seckill   [  32% ] 00002/00500 VUs  0m39.0s/2m0s  01597.40 iters/s

running (0m40.0s), 00001/00500 VUs, 29766 complete and 0 interrupted iterations
staged_seckill   [  33% ] 00001/00500 VUs  0m40.0s/2m0s  01664.03 iters/s

running (0m41.0s), 00002/00500 VUs, 31463 complete and 0 interrupted iterations
staged_seckill   [  34% ] 00002/00500 VUs  0m41.0s/2m0s  01730.72 iters/s

running (0m42.0s), 00002/00500 VUs, 33227 complete and 0 interrupted iterations
staged_seckill   [  35% ] 00002/00500 VUs  0m42.0s/2m0s  01797.39 iters/s

running (0m43.0s), 00001/00500 VUs, 35058 complete and 0 interrupted iterations
staged_seckill   [  36% ] 00001/00500 VUs  0m43.0s/2m0s  01864.03 iters/s

running (0m44.0s), 00002/00500 VUs, 36955 complete and 0 interrupted iterations
staged_seckill   [  37% ] 00002/00500 VUs  0m44.0s/2m0s  01930.72 iters/s

running (0m45.0s), 00001/00500 VUs, 38921 complete and 0 interrupted iterations
staged_seckill   [  37% ] 00002/00500 VUs  0m45.0s/2m0s  01997.45 iters/s

running (0m46.0s), 00001/00500 VUs, 40950 complete and 0 interrupted iterations
staged_seckill   [  38% ] 00002/00500 VUs  0m46.0s/2m0s  02064.06 iters/s

running (0m47.0s), 00002/00500 VUs, 43047 complete and 0 interrupted iterations
staged_seckill   [  39% ] 00002/00500 VUs  0m47.0s/2m0s  02130.72 iters/s

running (0m48.0s), 00004/00500 VUs, 45209 complete and 0 interrupted iterations
staged_seckill   [  40% ] 00004/00500 VUs  0m48.0s/2m0s  02197.38 iters/s

running (0m49.0s), 00003/00500 VUs, 47441 complete and 0 interrupted iterations
staged_seckill   [  41% ] 00003/00500 VUs  0m49.0s/2m0s  02264.05 iters/s

running (0m50.0s), 00002/00500 VUs, 49739 complete and 0 interrupted iterations
staged_seckill   [  42% ] 00002/00500 VUs  0m50.0s/2m0s  02330.71 iters/s

running (0m51.0s), 00002/00500 VUs, 52103 complete and 0 interrupted iterations
staged_seckill   [  42% ] 00002/00500 VUs  0m51.0s/2m0s  02397.37 iters/s

running (0m52.0s), 00001/00500 VUs, 54533 complete and 0 interrupted iterations
staged_seckill   [  43% ] 00002/00500 VUs  0m52.0s/2m0s  02464.04 iters/s

running (0m53.0s), 00003/00500 VUs, 57033 complete and 0 interrupted iterations
staged_seckill   [  44% ] 00003/00500 VUs  0m53.0s/2m0s  02530.79 iters/s

running (0m54.0s), 00002/00500 VUs, 59595 complete and 0 interrupted iterations
staged_seckill   [  45% ] 00002/00500 VUs  0m54.0s/2m0s  02597.37 iters/s

running (0m55.0s), 00002/00500 VUs, 62226 complete and 0 interrupted iterations
staged_seckill   [  46% ] 00002/00500 VUs  0m55.0s/2m0s  02664.05 iters/s

running (0m56.0s), 00008/00500 VUs, 64918 complete and 0 interrupted iterations
staged_seckill   [  47% ] 00007/00500 VUs  0m56.0s/2m0s  02730.73 iters/s

running (0m57.0s), 00000/00500 VUs, 67688 complete and 0 interrupted iterations
staged_seckill   [  47% ] 00002/00500 VUs  0m57.0s/2m0s  02797.44 iters/s

running (0m58.0s), 00002/00500 VUs, 70518 complete and 0 interrupted iterations
staged_seckill   [  48% ] 00002/00500 VUs  0m58.0s/2m0s  02864.04 iters/s

running (0m59.0s), 00004/00500 VUs, 73414 complete and 0 interrupted iterations
staged_seckill   [  49% ] 00004/00500 VUs  0m59.0s/2m0s  02930.72 iters/s

running (1m00.0s), 00003/00500 VUs, 76377 complete and 0 interrupted iterations
staged_seckill   [  50% ] 00003/00500 VUs  1m00.0s/2m0s  02997.34 iters/s

running (1m01.0s), 00003/00500 VUs, 79409 complete and 0 interrupted iterations
staged_seckill   [  51% ] 00003/00500 VUs  1m01.0s/2m0s  03064.06 iters/s

running (1m02.0s), 00003/00500 VUs, 82507 complete and 0 interrupted iterations
staged_seckill   [  52% ] 00003/00500 VUs  1m02.0s/2m0s  03130.71 iters/s

running (1m03.0s), 00003/00500 VUs, 85671 complete and 0 interrupted iterations
staged_seckill   [  52% ] 00003/00500 VUs  1m03.0s/2m0s  03197.38 iters/s

running (1m04.0s), 00004/00500 VUs, 88901 complete and 0 interrupted iterations
staged_seckill   [  53% ] 00003/00500 VUs  1m04.0s/2m0s  03264.06 iters/s

running (1m05.0s), 00004/00500 VUs, 92198 complete and 0 interrupted iterations
staged_seckill   [  54% ] 00004/00500 VUs  1m05.0s/2m0s  03330.72 iters/s

running (1m06.0s), 00003/00500 VUs, 95563 complete and 0 interrupted iterations
staged_seckill   [  55% ] 00003/00500 VUs  1m06.0s/2m0s  03397.39 iters/s

running (1m07.0s), 00004/00500 VUs, 98993 complete and 0 interrupted iterations
staged_seckill   [  56% ] 00004/00500 VUs  1m07.0s/2m0s  03464.06 iters/s

running (1m08.0s), 00004/00500 VUs, 102490 complete and 0 interrupted iterations
staged_seckill   [  57% ] 00004/00500 VUs  1m08.0s/2m0s  03530.71 iters/s

running (1m09.0s), 00006/00500 VUs, 106052 complete and 0 interrupted iterations
staged_seckill   [  57% ] 00005/00500 VUs  1m09.0s/2m0s  03597.37 iters/s

running (1m10.0s), 00010/00500 VUs, 109679 complete and 0 interrupted iterations
staged_seckill   [  58% ] 00010/00500 VUs  1m10.0s/2m0s  03664.05 iters/s

running (1m11.0s), 00001/00500 VUs, 113385 complete and 0 interrupted iterations
staged_seckill   [  59% ] 00003/00500 VUs  1m11.0s/2m0s  03730.79 iters/s

running (1m12.0s), 00003/00500 VUs, 117147 complete and 0 interrupted iterations
staged_seckill   [  60% ] 00003/00500 VUs  1m12.0s/2m0s  03797.39 iters/s

running (1m13.0s), 00002/00500 VUs, 120976 complete and 0 interrupted iterations
staged_seckill   [  61% ] 00005/00500 VUs  1m13.0s/2m0s  03864.05 iters/s

running (1m14.0s), 00001/00500 VUs, 124874 complete and 0 interrupted iterations
staged_seckill   [  62% ] 00001/00500 VUs  1m14.0s/2m0s  03930.69 iters/s

running (1m15.0s), 00003/00500 VUs, 128839 complete and 0 interrupted iterations
staged_seckill   [  62% ] 00003/00500 VUs  1m15.0s/2m0s  03997.38 iters/s

running (1m16.0s), 00004/00500 VUs, 132869 complete and 0 interrupted iterations
staged_seckill   [  63% ] 00004/00500 VUs  1m16.0s/2m0s  04064.05 iters/s

running (1m17.0s), 00005/00500 VUs, 136965 complete and 0 interrupted iterations
staged_seckill   [  64% ] 00005/00500 VUs  1m17.0s/2m0s  04130.70 iters/s

running (1m18.0s), 00002/00500 VUs, 141130 complete and 0 interrupted iterations
staged_seckill   [  65% ] 00002/00500 VUs  1m18.0s/2m0s  04197.36 iters/s

running (1m19.0s), 00003/00500 VUs, 145362 complete and 0 interrupted iterations
staged_seckill   [  66% ] 00003/00500 VUs  1m19.0s/2m0s  04264.03 iters/s

running (1m20.0s), 00004/00500 VUs, 149659 complete and 0 interrupted iterations
staged_seckill   [  67% ] 00004/00500 VUs  1m20.0s/2m0s  04330.73 iters/s

running (1m21.0s), 00003/00500 VUs, 154024 complete and 0 interrupted iterations
staged_seckill   [  67% ] 00003/00500 VUs  1m21.0s/2m0s  04397.38 iters/s

running (1m22.0s), 00005/00500 VUs, 158452 complete and 0 interrupted iterations
staged_seckill   [  68% ] 00004/00500 VUs  1m22.0s/2m0s  04464.05 iters/s

running (1m23.0s), 00008/00500 VUs, 162952 complete and 0 interrupted iterations
staged_seckill   [  69% ] 00008/00500 VUs  1m23.0s/2m0s  04530.79 iters/s

running (1m24.0s), 00003/00500 VUs, 167515 complete and 0 interrupted iterations
staged_seckill   [  70% ] 00003/00500 VUs  1m24.0s/2m0s  04597.36 iters/s

running (1m25.0s), 00003/00500 VUs, 172146 complete and 0 interrupted iterations
staged_seckill   [  71% ] 00003/00500 VUs  1m25.0s/2m0s  04664.05 iters/s

running (1m26.0s), 00003/00500 VUs, 176843 complete and 0 interrupted iterations
staged_seckill   [  72% ] 00003/00500 VUs  1m26.0s/2m0s  04730.70 iters/s

running (1m27.0s), 00004/00500 VUs, 181607 complete and 0 interrupted iterations
staged_seckill   [  72% ] 00004/00500 VUs  1m27.0s/2m0s  04797.38 iters/s

running (1m28.0s), 00004/00500 VUs, 186437 complete and 0 interrupted iterations
staged_seckill   [  73% ] 00004/00500 VUs  1m28.0s/2m0s  04864.05 iters/s

running (1m29.0s), 00004/00500 VUs, 191335 complete and 0 interrupted iterations
staged_seckill   [  74% ] 00004/00500 VUs  1m29.0s/2m0s  04930.70 iters/s

running (1m30.0s), 00004/00500 VUs, 196299 complete and 0 interrupted iterations
staged_seckill   [  75% ] 00004/00500 VUs  1m30.0s/2m0s  04997.38 iters/s

running (1m31.0s), 00010/00500 VUs, 201376 complete and 0 interrupted iterations
staged_seckill   [  76% ] 00010/00500 VUs  1m31.0s/2m0s  05160.30 iters/s

running (1m32.0s), 00005/00500 VUs, 206618 complete and 0 interrupted iterations
staged_seckill   [  77% ] 00005/00500 VUs  1m32.0s/2m0s  05326.77 iters/s

running (1m33.0s), 00007/00500 VUs, 212026 complete and 0 interrupted iterations
staged_seckill   [  77% ] 00006/00500 VUs  1m33.0s/2m0s  05493.45 iters/s

running (1m34.0s), 00007/00500 VUs, 217603 complete and 0 interrupted iterations
staged_seckill   [  78% ] 00007/00500 VUs  1m34.0s/2m0s  05660.11 iters/s

running (1m35.0s), 00004/00500 VUs, 223349 complete and 0 interrupted iterations
staged_seckill   [  79% ] 00004/00500 VUs  1m35.0s/2m0s  05826.79 iters/s

running (1m36.0s), 00005/00500 VUs, 229258 complete and 0 interrupted iterations
staged_seckill   [  80% ] 00005/00500 VUs  1m36.0s/2m0s  05993.44 iters/s

running (1m37.0s), 00451/00546 VUs, 234282 complete and 0 interrupted iterations
staged_seckill   [  81% ] 00451/00546 VUs  1m37.0s/2m0s  06157.10 iters/s

running (1m38.0s), 00003/00547 VUs, 241092 complete and 0 interrupted iterations
staged_seckill   [  82% ] 00004/00547 VUs  1m38.0s/2m0s  06326.95 iters/s

running (1m39.0s), 00007/00547 VUs, 247498 complete and 0 interrupted iterations
staged_seckill   [  82% ] 00007/00547 VUs  1m39.0s/2m0s  06493.42 iters/s

running (1m40.0s), 00006/00547 VUs, 254075 complete and 0 interrupted iterations
staged_seckill   [  83% ] 00006/00547 VUs  1m40.0s/2m0s  06660.10 iters/s

running (1m41.0s), 00007/00547 VUs, 260819 complete and 0 interrupted iterations
staged_seckill   [  84% ] 00006/00547 VUs  1m41.0s/2m0s  06826.78 iters/s

running (1m42.0s), 00005/00547 VUs, 267729 complete and 0 interrupted iterations
staged_seckill   [  85% ] 00005/00547 VUs  1m42.0s/2m0s  06993.45 iters/s

running (1m43.0s), 00007/00547 VUs, 274807 complete and 0 interrupted iterations
staged_seckill   [  86% ] 00008/00547 VUs  1m43.0s/2m0s  07160.14 iters/s

running (1m44.0s), 00007/00547 VUs, 282048 complete and 0 interrupted iterations
staged_seckill   [  87% ] 00007/00547 VUs  1m44.0s/2m0s  07326.76 iters/s

running (1m45.0s), 00006/00547 VUs, 289459 complete and 0 interrupted iterations
staged_seckill   [  87% ] 00007/00547 VUs  1m45.0s/2m0s  07493.50 iters/s

running (1m46.0s), 00020/00547 VUs, 297025 complete and 0 interrupted iterations
staged_seckill   [  88% ] 00019/00547 VUs  1m46.0s/2m0s  07660.19 iters/s

running (1m47.0s), 00009/00547 VUs, 304785 complete and 0 interrupted iterations
staged_seckill   [  89% ] 00009/00547 VUs  1m47.0s/2m0s  07826.93 iters/s

running (1m48.0s), 00006/00547 VUs, 312690 complete and 0 interrupted iterations
staged_seckill   [  90% ] 00006/00547 VUs  1m48.0s/2m0s  07993.41 iters/s

running (1m49.0s), 00000/00547 VUs, 320769 complete and 0 interrupted iterations
staged_seckill   [  91% ] 00000/00547 VUs  1m49.0s/2m0s  08160.00 iters/s

running (1m50.0s), 00008/00547 VUs, 329008 complete and 0 interrupted iterations
staged_seckill   [  92% ] 00008/00547 VUs  1m50.0s/2m0s  08326.81 iters/s

running (1m51.0s), 00007/00547 VUs, 337420 complete and 0 interrupted iterations
staged_seckill   [  92% ] 00007/00547 VUs  1m51.0s/2m0s  08493.51 iters/s

running (1m52.0s), 00010/00547 VUs, 345991 complete and 0 interrupted iterations
staged_seckill   [  93% ] 00010/00547 VUs  1m52.0s/2m0s  08660.11 iters/s

running (1m53.0s), 00007/00547 VUs, 354738 complete and 0 interrupted iterations
staged_seckill   [  94% ] 00007/00547 VUs  1m53.0s/2m0s  08826.75 iters/s

running (1m54.0s), 00008/00547 VUs, 363648 complete and 0 interrupted iterations
staged_seckill   [  95% ] 00007/00547 VUs  1m54.0s/2m0s  08993.37 iters/s

running (1m55.0s), 00009/00547 VUs, 372724 complete and 0 interrupted iterations
staged_seckill   [  96% ] 00009/00547 VUs  1m55.0s/2m0s  09160.11 iters/s

running (1m56.0s), 00022/00547 VUs, 381952 complete and 0 interrupted iterations
staged_seckill   [  97% ] 00021/00547 VUs  1m56.0s/2m0s  09326.71 iters/s

running (1m57.0s), 00002/00547 VUs, 391379 complete and 0 interrupted iterations
staged_seckill   [  97% ] 00002/00547 VUs  1m57.0s/2m0s  09493.34 iters/s

running (1m58.0s), 00011/00547 VUs, 400948 complete and 0 interrupted iterations
staged_seckill   [  98% ] 00010/00547 VUs  1m58.0s/2m0s  09660.06 iters/s

running (1m59.0s), 00012/00547 VUs, 410694 complete and 0 interrupted iterations
staged_seckill   [  99% ] 00013/00547 VUs  1m59.0s/2m0s  09826.75 iters/s

running (2m00.0s), 00031/00547 VUs, 420587 complete and 0 interrupted iterations
staged_seckill   [ 100% ] 00031/00547 VUs  2m00.0s/2m0s  09993.40 iters/s

     ✗ token issued
      ↳  99% — ✓ 418247 / ✗ 2738
     ✗ business response is expected
      ↳  87% — ✓ 364238 / ✗ 54009

     business_acceptance_rate.......: 0.23%  1000 out of 418247
     business_orders_accepted.......: 1000   8.333174/s
     business_orders_rejected.......: 417247 3476.99175/s
   ✗ business_token_failures........: 2738   22.81623/s
     checks.........................: 93.23% 782485 out of 839232
     data_received..................: 194 MB 1.6 MB/s
     data_sent......................: 139 MB 1.2 MB/s
     dropped_iterations.............: 489    4.074922/s
     http_req_blocked...............: avg=1.83µs   min=292ns    med=916ns    max=31.41ms  p(90)=1.5µs    p(95)=1.87µs 
     http_req_connecting............: avg=401ns    min=0s       med=0s       max=21.29ms  p(90)=0s       p(95)=0s     
     http_req_duration..............: avg=797.46µs min=71.33µs  med=382.58µs max=180.9ms  p(90)=756.03µs p(95)=1.38ms 
       { expected_response:true }...: avg=784.83µs min=134.45µs med=380µs    max=158.44ms p(90)=738.31µs p(95)=1.32ms 
   ✗ http_req_failed................: 6.76%  56747 out of 839232
     http_req_receiving.............: avg=26.58µs  min=2.66µs   med=8µs      max=61.48ms  p(90)=17.04µs  p(95)=44.62µs
     http_req_sending...............: avg=6.36µs   min=958ns    med=2.41µs   max=46.02ms  p(90)=5.16µs   p(95)=9.33µs 
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s     
     http_req_waiting...............: avg=764.52µs min=49.54µs  med=369.16µs max=180.77ms p(90)=721.04µs p(95)=1.31ms 
     http_reqs......................: 839232 6993.466078/s
     iteration_duration.............: avg=1.67ms   min=108.2µs  med=831.04µs max=221.2ms  p(90)=1.63ms   p(95)=3.14ms 
     iterations.....................: 420985 3508.141154/s
   ✓ seckill_latency................: avg=776.25µs min=156.91µs med=400.2µs  max=158.44ms p(90)=775.66µs p(95)=1.34ms 
     vus............................: 31     min=0                max=451
     vus_max........................: 547    min=500              max=547


running (2m00.0s), 00000/00547 VUs, 420985 complete and 0 interrupted iterations
staged_seckill ✓ [ 100% ] 00000/00547 VUs  2m0s  09999.60 iters/s